'number' + 3 + 3;
/* 
    спочатку відбувається конкатенація 'number' + 3 = 'number3'
    потім відбувається конкатенація 'number3' + 3 = 'number33'
    результат 'number33' – рядок
*/

null + 3;
/* 
    null конвертується в 0
    0 + 3 = 3
    результат 3 – число
*/

5 && "qwerty"
/* 
    5 конвертується в true
    оператор && повертає значення останнього операнда, якщо інші операнди true
    результат "qwerty" – рядок
*/

+'40' + +'2' + "hillel";
/* 
    + це унарний оператор, який конвертує операнд в число
    спочатку відбувається конвертація рядків в числа +'40' + +'2' = 40 + 2 = 42
    потім відбувається конкатенація числа 42 і рядка "hillel"
    результат '42hillel' – рядок
*/

'10' - 5 === 6;
/* 
    '10'-5 = 5 – число
    5 === 6 – false
    результат false – булеве значення
*/

true + false
/* 
    true конвертується в 1
    false конвертується в 0
    1 + 0 = 1
    результат 1 – число
*/

'4px' - 3
/* 
    оскільки намагаємось від рядка з буквеними символами відняти число, то рядок конвертується в NaN
    NaN - 3 = NaN
    результат NaN – число
*/

'4' - 3
/* 
    оскільки рядок містить лише цифри, то він конвертується в число
    4 - 3 = 1
    результат 1 – число
*/

'6' + 3 ** 0;
/* 
    спочатку відбувається обчислення зведення в ступінь 3 ** 0 = 1
    потім відбувається конкатенація рядка '6' і числа 1
    результат '61' – рядок
*/

12 / '6'
/* 
    рядок конвертується в число
    12 / 6 = 2
    результат 2 – число
*/

'10' + (5 === 6);
/* 
    спочатку виконується порівняння в дужках 5 === 6 = false
    потім відбувається конкатенація рядка '10' і булевого значення false
    результат '10false' – рядок
*/

null == ''
/* 
    null конвертується в 0
    порівняння 0 == '' = false
    результат false – булеве значення
*/

3 ** (9 / 3);
/* 
    спочатку відбувається обчислення в дужках 9 / 3 = 3
    потім зведення в ступінь 3 ** 3 = 27
    результат 27 – число
*/

!!'false' == !!'true'
/* 
    рядок 'false' конвертується в булеве true
    рядок 'true' конвертується в булеве true
    порівнюються true == true
    результат true – булеве значення
*/

0 || '0' && 1
/*
    спочатку відбувається операція '0' && 1 – оператор && повертає значення останнього операнда, якщо інші операнди true – результат 1
    потім відбувається операція 0 || 1 – оператор || повертає значення true
    результат 1 – число
*/

(+null == false) < 1;
/* 
    null конвертується в 0
    +null = 0
    0 == false = true
    true < 1 = false
    результат false – булеве значення
*/

false && true || true
/* 
    спочатку відбувається операція false && true. && повертає перший операндн, котрий false
    потім відбувається операція false || true – оператор || повертає значення true
    результат true – булеве значення
*/

false && (false || true);
/* 
    спочатку відбувається операція false || true – оператор || повертає значення true
    потім відбувається операція false && true. && повертає перший операндн, котрий false
    результат false – булеве значення
*/

(+null == false) < 1 ** 5;
/* 
    + ковертує null в 0
    спочатку відбувається операція 0 == false – результат true
    потім 1 ** 5 = 1
    true < 1 = false
    результат false – булеве значення
*/
